In [1]:
import pandas as pd

In [25]:
df = pd.DataFrame({'c1':[1,2,3,4], 'C 2':['a','b','c','d']})

In [22]:
df

   c1 C 2
0   1   a
1   2   b
2   3   c
3   4   d

In [4]:
#тут str.lower - передается как функция
df.rename(columns = str.lower)

   c1 c 2
0   1   a
1   2   b
2   3   c
3   4   d

In [6]:
#например
my_func = str.lower

#теперь вызываем
my_func('ASDF 2')

'asdf 2'

In [7]:
#вызов
my_func_result = str.lower('ASDF 2')

my_func_result

'asdf 2'

In [9]:
#если вызвать 
#str.replace(' ', '_')
#будет ошибка

In [10]:
help(str.replace)

Help on method_descriptor:

replace(self, old, new, count=-1, /)
    Return a copy with all occurrences of substring old replaced by new.

      count
        Maximum number of occurrences to replace.
        -1 (the default value) means replace all occurrences.

    If the optional argument count is given, only the first count occurrences are
    replaced.

In [11]:
#так будет берно
str.replace('ASDF 2', ' ', '_')

'ASDF_2'

In [12]:
#Как передать replace как функцию
my_replace_func = str.replace

#теперь вызываем c стремя аргументами
my_replace_func('ASDF 2', ' ', '_')

'ASDF_2'

In [14]:
#как передать replace в df.rename?

#передать можно так, 
#df.rename(columns=str.replace)
#НО функции нужно 3 аргумента, для выполнения задачи нужны еще ' ' и '_' я не вижу спопба их передать
#будет ошибка

In [18]:
#к тому же нам нужно над каждым именем колонки выполнить две операции 
#1) заменить пробел на _ (str.replace('some str', ' ', '_'))
#2) lower

#например
for clmn in df.columns:
    print(clmn \
        .replace(' ', '_') \
        .lower())

c1
c_2

In [20]:
#итого:
def replace_space_lower(s):
    return s.replace(' ', '_').lower()

df.rename(columns = replace_space_lower)

   c1 c_2
0   1   a
1   2   b
2   3   c
3   4   d

In [26]:
#или

df.rename(columns = lambda s: s.replace(' ', '').lower())

   c1 c2
0   1  a
1   2  b
2   3  c
3   4  d

In [27]:
tmp = str.replase(' ','_') #тут ошибка

AttributeError: type object 'str' has no attribute 'replase'

In [28]:
help(str.replace) #справка

Help on method_descriptor:

replace(self, old, new, count=-1, /)
    Return a copy with all occurrences of substring old replaced by new.

      count
        Maximum number of occurrences to replace.
        -1 (the default value) means replace all occurrences.

    If the optional argument count is given, only the first count occurrences are
    replaced.

In [ ]:
#посмотрите что будет в tmp
type(tmp)

In [29]:
tmp = str.lower
#посмотрите что будет в tmp
type(tmp)

method_descriptor

In [30]:
df.rename(columns = tmp)

   c1 c 2
0   1   a
1   2   b
2   3   c
3   4   d